module.exports = {
	cr: ['каждого зверя','каждым зверем'],
	
	Creature: ['зверь','зверя'],
	
	// функции из base.js
	'../base': 'источнику',
	foreach: 'для каждого случая',
	'random (': {
		token: 'что-то между',
		end: {',\n': ')'}
	},
	merge: ['объединяшка','объединяшкой'],
	
	// методы Creature
	create: 'созидание',
	init: 'начало',
	getParams: ['взятие параметров','взятия параметров'],
	getInRange: 'узнать, что кто-то близко',
	kill: 'убить',
	isDead: 'узнать, мертвый ли',
	getDamage: 'получить повреждение',
	fight: 'драться',
	getDistance: 'узнать, что расстояние',
	
	// поля Creature
	pool: ['хранилищем','хранилище'],
	range: ['дистанция атаки','дистанции атаки'],
	health: 'здоровье',
	index: ['номером','номер'],
	offence: ['сила атаки','силой атаки','силу атаки'],
	defence: 'сила защиты',
	
	params: 'параметрами',
	defaults: ['по умолчанию','умолчанием'],
	result: 'результат',
	target: 'целью',
	strength: ['силой','сила','силу'],
	'other.': 'у другого',
	other: ['другим','другой']
};
