застывшие внутри для каждого случая, что-то между и объединяшка - это вопрос к источнику.

страшный зверь - это такой способ с параметрами:
	у него начало с параметрами.
вот.

зверь также содержит созидание - это такой способ с номером и параметрами:
	страшный по умолчанию - это штуковина, которая содержит:
		номер по сути номер,
		дистанция атаки по сути 0,
		здоровье по сути что-то между 50 и 100,
		сила атаки по сути что-то между 0 и 10,
		сила защиты по сути что-то между 0 и 10,
	вот.
	
	вали-ка ты, новый зверь c объединяшкой с умолчанием, параметрами или пустой штуковиной.
вот.

зверь также содержит другие штуковины:
	начало по сути такой способ с параметрами:
		у него узнать, что расстояние - это ничто.
		у него хранилище - это массив.
		у него дистанция атаки - это 0.
		у него здоровье - это 0.
		у него номер - это 0.
		у него сила атаки - это 0.
		у него сила защиты - это 0.
		объединяшка c собой и параметрами.
	вот,
	
	взятие параметров по сути такой способ:
		вали-ка ты, объединяшка с пустой штуковиной, собой и массивом ("сила атаки", "сила защиты", "здоровье", "дистанция атаки").
	вот,
	
	узнать, что кто-то близко - по сути такой способ:
		страшный результат - это массив.
		
		для каждого случая с его хранилищем, способ с каждым зверем:
			если у него узнать, что растояние с каждым зверем меньше либо равно его дистанции атаки
				результат получает каждого зверя.
			вот
		вот-вот.
		
		вали-ка ты, результат.
	вот,
	
	убить - по сути такой способ с целью:
		его хранилище делает удаление из массива с целью или собой, содержащими номер, а также 1
	вот,
	
	узнать, мертвый ли - по сути такой способ с целью:
		вали-ка ты с целью или собой, содержащими утверждение, что здоровье меньше либо равна 0.
	вот,
	
	получить повреждение по сути такой способ с силой:
		сила уменьшается на его сила защиты.
		если сила меньше либо равна 0, то вали-ка ты ни с чем.
		
		у него здоровье уменьшается на силу.
		
		если у него узнать, мертвый ли, то самоубить.
		вали-ка ты с результатом его взятия параметров.
	вот,
	
	драться - по сути такой способ с другим:
		если у него узнать, что расстояние с другим больше дистанции атаки, то вали-ка ты.
		
		другой делает получить повреждение с его силой атаки.
		
		если у другого узнать, мертвый ли
			другой делает убить себя.
			вали-ка ты.
		вот.
		
		сам получить повреждение с другим, содержащим силу атаки.
	вот
вот.

отдам бесплатно зверя.